app/views/users/show.html.erb

SELECT COUNT(*) FROM "characters" WHERE "characters"."user_id" = 1
---
  <div class="span8">
  	<% if @user.characters.any? %>