app/views/shared/_user_info.html.erb

<span>
  <%= pluralize(current_user.characters.count, "character") %>
---
SELECT COUNT(*) FROM "characters" WHERE "characters"."user_id" = 1