app/controllers/characters_controller.rb

  def create
  	@character = current_user.characters.build(params[:character])
  	if @character.save
---
INSERT INTO "characters" ("created_at", "name", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", Sat, 23 Mar 2013 16:53:44 UTC +00:00], ["name", "Steve Allenson"], ["updated_at", Sat, 23 Mar 2013 16:53:44 UTC +00:00], ["user_id", 1]]

  def destroy
    @character.destroy
---
DELETE FROM "characters" WHERE "characters"."id" = ?  [["id", 1]]