app/controllers/static_pages_controller.rb

SELECT "characters".* FROM "characters" WHERE (user_id = 1) ORDER BY characters.created_at DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "characters" WHERE "characters"."user_id" = 1
---
  def home
  	if signed_in?
  		@character  = current_user.characters.build
  		@feed_items = current_user.feed.paginate(page: params[:page])