app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "characters".* FROM "characters" WHERE "characters"."user_id" = 1 ORDER BY characters.created_at DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "characters" WHERE "characters"."user_id" = 1
---
	def show
		@user = User.find(params[:id])
		@characters = @user.characters.paginate(page: params[:page])